
#ifndef CNET_PORTS
   #define CNET_PORTS

   #ifndef CNETPORT
      #define CNETPORT "cnetport"
   #endif

#include "ranges.h"
#include "users.h"
#include "doors.h"
#include "mail.h"
#include "lists.h"
#include "links.h"
#include "telnet.h"


/*
 * #?-task message port names
 */
#define MAILTASKPORT "cnmail_serv"
#define FILETASKPORT "cnfile_serv"
#define YANKTASKPORT "cnyank_serv"
#define NEWSTASKPORT "cnnews_serv"
#define USEREDPORT   "cnusered_port"
#define MIMEEDPORT   "cnmimeed_port"
#define SMTPTASKPORT "cnsmtpd_port"
#define FTPTASKPORT  "cnftpd_port"
#define CRONPORT     "cncron_port"
#define TELNETDPORT  "cntlntd_port"
#define BBSLISTPORT  "cnetbbslist"


/*
 *
 * defines for SendTaskMessage() cmd arguments
 *
 * TASK_xxxxxx_MSG applies to all CNet server tasks
 *
 */
#define TASK_REPOSICON_MSG      0x01 /* reposition icon           */
#define TASK_QUIT_MSG           0x02 /* quit task                 */
#define TASK_ICONIFY_MSG        0x03 /* iconify GUI               */
#define TASK_MENUFY_MSG         0x04 /* menufy                    */
#define TASK_SHOWIFACE_MSG      0x05 /* show interface/GUI        */
#define TASK_SNAPSHOT_MSG       0x06 /* snapshot current position */


/*
 * Control-specific commands
 */
#define CTRL_UNLOCK_MSG         0x64               /* unlock control (100dec) */
#define CTRL_REPOSICON_MSG      TASK_REPOSICON_MSG /* reposition icon */
#define CTRL_DOEVENTS_MSG       0x65               /* execute queued events */

/*
 * mail-task specific commands
 */
#define MT_RESCAN_MSG           0x20 /* free current spool list and rescan mail:cnetoutbox/spool */
#define MT_SENDSPOOL_MSG        0x21 /* attempt to send any spool mail that is waiting.          */
#define MT_PAUSE_MSG            0x22 /* pause mail processing. */
#define MT_RESUME_MSG           0x23 /* resume mail processing. */

/*
 * END OF SendTaskMessage() cmd DEFINES
 */


#define PITEM_MAX 8 /* maximum z->npitems value.. */


struct CNetPort
	{
   char   UserName[32];
   char   From[32];
   char   Area[32];
   char   Action[32];

   ULONG   Baud;
   ULONG   Logon;

   USHORT   Port;
   USHORT   Access;
	} __attribute__((packed));


#define PORTRIGHT_HIDDEN       0x0001
#define PORTRIGHT_MUFFLED      0x0002
#define PORTRIGHT_CHATENABLE   0x0004
#define PORTRIGHT_NOTHIDDEN    0x0008
#define PORTRIGHT_NOTMUFFLED   0x0010
#define PORTRIGHT_CHATDISABLE  0x0020


struct SerPort
   {
   long   unit;
   long   flags;

   short   idlebaud;
   short   escape;
   short   answerpause;
   short   seconds;

   char   name[22];
   char   init1[49];
   char   ppass[11];
   char   init2[50];

   ULONG   TrapHours;
   ULONG   MailHours;

   UBYTE   extra[3];

   char   hangup[21];
   char   dialout[21];
   char   answer[21];
   char   offhook[21];
   char   terminal[50];
   char   callerid[11];
   char   ring[9];
   char   connect[11];

   char   termlink[21];

   UBYTE   other[2];

   UBYTE   null;      /* local terminal, no clear line */
   } __attribute__((packed));


// revised 28-Feb-98!
struct SerPort4
   {
   long   unit;
   long   flags;

   short   idlebaud;
   short   escape;
   short   answerpause;
   short   seconds;

   char   name[40];
   char   init1[50];
   char   ppass[11];
   char   init2[50];

   ULONG   TrapHours;
   ULONG   MailHours;

   char   hangup[21];
   char   dialout[21];
   char   answer[21];
   char   offhook[21];
   char   terminal[50];
   char   callerid[11];
   char   ring[9];
   char   connect[11];

   char   termlink[21];
   UBYTE   null;        // local terminal, no clear line

   char IdleWho[21];    // 18-Feb-97 - text displayed in the "Handle/Name" area of who for idle port(s)

   long   portflags;    // 23-Apr-97

   BYTE expansion[103];
   } __attribute__((packed));

/*
 * SerPort4.portflags defines
 */
#define SP_PF_SHOWONWHO (1L << 0)  // show port on WHO display.  if bit not set, do not show port on WHO
#define SP_PF_TELNETD   (1L << 1)  // this is a telnetd port - this setting only used by CNet's native telnetd daemon
#define SP_PF_OFFCLOSE  (1L << 2)  // if this is set, the port is unloaded after user logs off.



struct PortData {                   // each opened ports global vars
   struct   IsDate   Today;         // 0 what time is it right now?
   struct   IsDate   VConnectDate;  // 6 Virtual connect...eg 12am

   short   id,                      // 12 current user1 account #
      InPort,                       // 14 which port are we in?? 
      Age,                          // 16 how old am I ?
      CurrentCPS,                   // 18 CPS rate.  240 == 2400 baud
      OnType,                       // 20 type of logon 
      OffType,                      // 22 type of logoff
      CallMessages,                 // 24 Messages written this call
      CallFeedbacks,                // 26 Feedbacks written this call
      TimeLeft,                     // 28 TENTHS of minutes left
      NotUsed1001,                  // 30 (WAS: TENTHS of minutes without activity)
      TimeOnLine,                   // 32 TENTHS of minutes since logon
      TimeCredit,                   // 34 TENTHS awarded for uploads, etc
      LastTSR,                      // 36 
      Carrier;                      // 38 Is there a carrier or Local?

   char   *AName;                   // 40 ptr to access group name
   long   SysMaint,                 // 44 TRUE if user has SYSOP_FLAG
      LocalTime,                    // 48 current area sur-time minutes
      LocalCharge,                  // 52 current area sur-charge per minute
      LastTime,                     // 56 
      ServLen,                      // 60 seconds in-between Service() calls
      Caller;                       // 64 which caller am I?

   struct   UserData   user1,       // 68
            user2;                  // 740 actual user structs

   short   MyMail;                  // 1412 counters for user currently online
   short   MyNewMail;               // 1414
   short   bn;                      // 1416 current sub #

   char   CallerID [18];            // 1418 Received from Supra, prev connect
   short   CIDmatch [ 8];           // Accounts which MATCH, [0] will be current user 

   UBYTE InFeedback;                // 1436 TRUE (1) if user is sending feedback - used to skip mail send flag prompt

   UBYTE NoClearIBuff;              // 1437 TRUE = add '/' to input buffer rather than use for buffer clearing operation 
   UBYTE NoSpaceAbort;              // 1438 TRUE = add SPACE to input stream rather than use as abort character
   UBYTE NoCaseConvert;             // 1439 TRUE = do not convert input from OneKey() to uppercase
	char *noweventname;					// pointer to ID (name) string of currently running event

	LONG sqopts;							// QUERY opts storage - used in ARexx QUERY
                                    // and PROMPT NORMAL commands

	ULONG EventTime;						// tenths of minutes that event has been running
	
   UBYTE   expansion;
	UBYTE	pkl;

   UBYTE   PAccess,                 //
      RAccess,
      DAccess,
      UAccess;

   char   fsuff[8],                 // 1474 more header stuff
      fcore[32],                    // 1482
      Title[80];                    // 1514 Screen/Window Title

	UBYTE in_logread;						// 08-Feb-98 - true if logread is currently being used.

   char	lastby_NOT[21];            // 1594 moved to struct PortDataExtension

	LONG ffnum;								// next available fifo "name unit"

	struct CNetFileEntry *dmfiles;	// list allocated by dmaint and freed upon exit

	struct IsDate BootDate;				// date port loaded

   UBYTE   IUCBits[100];            // 1630 Hidden, Muffled, Monitor, ChatReq

   char   *MyDoing;                 // 1730
   struct   Room *CRoom;            // 1734 which room am I in ?
   struct   RoomUser *CUser;        // 1738 where is my RoomUser struct

   UBYTE   Dumped,                  // 1742 auto-kickoff flag
      ATEdit,        					// 1743 Are we using "EL" on an item currently being read?
      HideAll,                      // 1744 Hidden from ALL?
      MuffAll,                      // 1745  Muffling ALL?
      MonitorAll,                   // 1746 Monitoring ALL?
      OnLine,                       // 1747 user logged in?
      nPdepth,                      // 1748 How many pfiles a port is running
      ChatCode,                     // 1749 who's chatting with whom
      WantToOpen,                   // 1750
      getout,                       // 1751 flag to auto-quit port
      loaded,                       // 1752 Is this port loaded?
      other[3];                     // 1753

   long   LastEvent,                // 1756 keep track of the last event
      LastCut,                      // 1760 time in these 4 catagories
      LastHold,                     // 1764
      LastOnLine;                   // 1768

   long   TempSysMaint;
   short   ConfIdle;

   struct NewMailFolder *Folders;   // 1778 - linked list of mail folders - may not be loaded until MailRead or MailSend
   struct NewMailFolder *Folder0;   // 1782 - pointer to folder currently in use

   struct MailHeader4 *rmhead;      // 1786 - linked list of mail header pointers allocated during mail read - mail only allocated for the currently "open" folder
   struct MailAlias *Aliases;       // 1790 - linked list of mail aliases - may not be loaded until MailRead/MailSend

   ULONG   DOIO_MASK;               // 1794
   struct   IOStdReq    *DoReq;     // 1798
   struct   MsgPort      *DoPort;   // 1802

   long   uz[10];                   // 1806 for C programmer use.  You can
                                    // (typecast) them as you need to

   struct   Task      *ThisTask;
   struct   MainPort   *cnp;

   struct   Window      *Window, *CWindow, *SWindow, *TWindow,
            *TTWindow, *WBWindow;
   struct   Screen      *Screen;
   struct   RastPort   *wrp, *trp;
   struct   TextFont   *BlueFont,
            *StandardFont;
   struct   IOStdReq    *UTReq, *ServReq, *PrintReq, *ConReq;
   struct   IOExtSer   *SerRdReq, *SerWrReq, *SerIOReq;
   struct   MsgPort      *SerRdPort,*SerWrPort,*SerIOPort, *ConPort,
            *UTPort,   *ServPort, *PrintPort, *cpreplyp;

   struct   FileInfoBlock   *fib;   // for reading directories
   struct   InfoData   *IData;      // for getting free disk space, etc
   struct   AnchorPath   *ap;
   struct   MessageType3    *Message;
   struct   BaseUser   *buser;
   struct   SelectType      *Select;
   struct   BaseUser   *brec;
   struct   SelectType   *Upload;
   struct   ListItem        *fpt;
   struct   ItemHeader   **ih, *ihead_obs;
   struct   ItemType3   **ip;
   char   **EdBuffer;               // pointers to editor lines
   char   *EdBase;                  // pointer to editor memory
   UBYTE   *CR;                     // Is there a Carriage Return? ea lin
   char   **mm;                     // pointers to bbsmenu lines
   char   **bm;                     // pointers to bbstext lines
   short   *menustart;
   short   *menulen;

   long   plsize, nplanes;          // SkyStuff Stuff
   short   skyxpen, skyypen;
   PLANEPTR planePtr;
   struct   TmpRas      tmpRas;
   struct   BitMap     SkyBrush;

   long   FullMaint;

   long   numWE;                    // window-edit, current number
   long   WWidth;                   // 80
   long   WLength;                  // 24
   long   WLeft;                    // def   0
   long   WRight;                   // def 639
   long   WTop;                     // def  11
   long   WBottom;                  // def YMAX

   short   xc,                      // x rastport coord, current cursor pos
      yc,                           // y rastport coord, current cursor pos

      sxc,                          // storage for ANSI [s, [t
      syc,
      YMAX,                         // max y value
      CurrentMouseX,
      CurrentMouseY,
      countWE;                      // window-edit, # characters
      
   short   IsHalfScreen;
   short   TermLength;

   short   SWidth;
   short   SHeight;
   short   DWidth;
   UBYTE   io_bad;
   UBYTE   io_status;               // debugging Supra hangs

   char   *by0,                     // scan and header variables
      *by1,                         // for MCI configurability
      *to0,
      *to1,
      *date0,
      *organ,

      plus[2],
      star[2],
      fdate[8],
      fsize[8],
      ftime[12],
      *title0,
      *olm_default,
      *vis_subj,
      *vis_to,
      *user_default,
      *subj_default;

   short   Depth;
   short   DHeight;

   short   TextSet;                 // 0==use system-wide text/menu
   short   npitems;                 // number of items parsed
   char   pitem[PITEM_MAX][61];     // last input parsed list

   long   txline;                   // number of lines in ed buffer
   char   GBuffer[16][81];          // General purpose 2-D text buffer
   UBYTE   GCR[16];

   ULONG   WaitFlags,
      SERVICE_MASK,
      RAWKEY_MASK;

   struct   JobType4 *pEvents;      // 4062 - list of waiting port events - queued events are Loaded when port is up and running

   struct SignalSemaphore pesem;    // 4066 - semaphore (46 bytes long) for locking pevents (port events) list
   struct SignalSemaphore mfsem;    // 4112 - semaphore (46 bytes long) for locking Folders list

   ULONG   eventtick;               // 4158 - events are ticking
   ULONG   nextevent;               // 4162 - time next event for this port - in seconds

   struct   SignalSemaphore sem;    // 4166
   LONG OLMWaiting;              	// 4212 - number of OLMs currently waiting..

   struct   MailHeader4 *POMail0;   // 4216 - pointer into z->rmhead - current message being read, edited or verified
   struct   ChargeSet  *NowCharge;

   long   CTC[80];                  // users account, 62 items, Cost of This Call

   short   sorder[SORDER_LIMIT];    // max subboards per subdir is SORDER_LIMIT
                                    // as defined in subs.h
                                    // ^^ needs to be changed to use DYNAMIC allocation
                                    // so it can bypass limit of 240!

   char   *LastError;               // for file transfer WHY command

   char   RexxObject  [100],
         KBuff       [256],         // keyboard buffer!

         *ABuffer;                  // 15-Apr-97 -> ABuffer now allocated dynamically at startup
                                    // (size of ABuffer now CONFIGURABLE via Config/Limits!)

   ULONG TimeIdle;                  // TENTHS of minutes without port activity

